          05 LCTFC101.
             10 TSQ-NAME            PIC N(16).
             10 TSQ-CONTENT.
                15 TSQ-CONTENT-LEN  PIC S9(4) COMP-5.
                15 TSQ-CONTENT-TEXT PIC N(2048).
