          05 LCTFC100.
             10 USERID            PIC N(08).
             10 FRAGMENT          PIC N(8).
             10 HINT.
                15 HINT-LEN       PIC S9(4) COMP-5.
                15 HINT-TEXT      PIC N(255).
