          05 LCTFC100.
             10 USERID            PIC N(08).
             10 NICKNAME.
                49 NICKNAME-LEN   PIC S9(4) USAGE COMP-5.
                49 NICKNAME-TEXT  PIC N(128).