          05 LCTFM003.
             10 OPCODE            PIC X.
             10 RETURNCODE        PIC X(02).
             10 REASONCODE        PIC X(02).
             10 INFOMESSAGE       PIC X(72).
             10 USERID            PIC X(08).
             10 FRAGMENT          PIC X(08).
             10 POINTS            PIC S9(9) USAGE COMP-5.