          05 LCTFM001.
             10 SQLQUERY.
                49 SQLQUERY-LEN   PIC S9(4) USAGE COMP-5.
                49 SQLQUERY-TEXT  PIC N(256).
             10 SQLCODE-C         PIC S9(5).