//FLAGBIND JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//BINDS   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=YINDB2.DB2.SDSNEXIT
//          DD DISP=SHR,DSN=DB2V13.DB2.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBY1)
  BIND PLAN(CTF2026) -
       PKLIST(CTF2026.*, LWW30101.LWWMIO, LWW30101.LWWMFIST) -
       OWNER(FLAGUSER) -
       QUALIFIER(CTF2026) -
       ACQUIRE(USE) -
       ENCODING(UNICODE)
  END
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//*
//GRANTS  EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=YINDB2.DB2.SDSNEXIT
//          DD DISP=SHR,DSN=DB2V13.DB2.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBY1)
  RUN PROGRAM(DSNTIAD) PLAN(DSNTIA13) PARMS('RC0') -
      LIB('YINDB2.DB2.RUNLIB.LOAD')
//SYSIN     DD *
  GRANT EXECUTE ON PLAN CTF2026 TO FLAGUSER;
  GRANT EXECUTE ON PACKAGE CTF2026.* TO FLAGUSER;
  GRANT EXECUTE ON PACKAGE LWW30101.LWWMIO TO FLAGUSER;
  GRANT EXECUTE ON PACKAGE LWW30101.LWWMFIST TO FLAGUSER;
  GRANT SELECT ON TABLE CTF2026.ACCLOG TO FLAGUSER;
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*