//FLAGBIND JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//BINDS   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=DSND10.DBDG.SDSNEXIT
//          DD DISP=SHR,DSN=DSND10.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBDG)
  BIND PLAN(CTF2026) -
       PKLIST(TLW30102.LWWMIO) -
       OWNER(FLAGUSER) -
       QUALIFIER(CTF2026) -
       ACQUIRE(USE) -
       ENCODING(UNICODE)
  END
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//*
//GRANTS  EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=DSND10.DBDG.SDSNEXIT
//          DD DISP=SHR,DSN=DSND10.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBDG)
  RUN PROGRAM(DSNTIAD) PLAN(DSNTIA13) PARMS('RC0') -
      LIB('DSND10.DBDG.RUNLIB.LOAD')
//SYSIN     DD *
  GRANT EXECUTE ON PLAN CTF2026 TO FLAGUSER;
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*