//FLAGCSD  JOB 'CTF2026 CSD DEFS',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//UPDCSD  EXEC PGM=DFHCSDUP,REGION=1M
//STEPLIB   DD DISP=SHR,DSN=CICS62.CICS.SDFHLOAD
//DFHCSD    DD DISP=SHR,DSN=YINCIC.CPSM.CIC3WB01.DFHCSD
//SYSIN     DD *
DEFINE TRANSACTION(FL01) GROUP(CTF2026)
       DESCRIPTION('CAPT FLAG TRANSACTION')
       PROGRAM(DFHWBA)
DEFINE DB2ENTRY(FL01) GROUP(CTF2026)
       DESCRIPTION('CAPT FLAG DB2ENTRY')
       TRANSID(FL01) PLAN(CTF2026)
DEFINE LIBRARY(LIBFLAG) GROUP(CTF2026)
       DESCRIPTION('CAPT FLAG LOAD LIBRARY')
       DSNAME01(YINCIC.CPSM.CIC3WB01.CTF2026.LOAD)
ADD G(CTF2026) LI(USRLIST)
//CBDOUT    DD SYSOUT=*
//SYSUT1    DD UNIT=SYSDA,SPACE=(1024,(100,100))
//SYSPRINT  DD SYSOUT=*