//RACFJOB  JOB 'RACF',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//STEP001 EXEC PROC=BATREXX
//COPY.SYSUT1 DD *,DLM=$$
/* REXX */
ADDRESS TSO "AG FLAGUSER SUPGROUP(SYS1) OWNER(SYS1)"

ADDRESS TSO "RDEF FACILITY DFHDB2.AUTHTYPE.FL01 UACC(NONE)"
ADDRESS TSO "PE DFHDB2.AUTHTYPE.FL01 CLASS(FACILITY)" || ,
            " ACCESS(READ) ID(YINADMIN,YINUSER,FLAGUSER,STCMAS)"

ADDRESS TSO "RDEF GCICSTRN CTFALL UACC(NONE)"
ADDRESS TSO "RALT GCICSTRN CTFALL ADDMEM(FL01)"
ADDRESS TSO "PE CTFALL CLASS(GCICSTRN) ACCESS(READ)" || ,
            " ID(YINADMIN,YINUSER,FLAGUSER)"

ADDRESS TSO "AU (CTF001) NAME('CAPT THE FLAG 001')", 
            " OWNER(SYS1) DFLTGRP(FLAGUSER)" 
ADDRESS TSO "ALU (CTF001) TSO(ACCTNUM(ACCT#) COMMAND(ISPF)", 
            " MAXSIZE(2096128) PROC(ISPFYIN) SIZE(2096128) UNIT(3390)" 
ADDRESS TSO "ALU (CTF001) OMVS(UID(1001) HOME(/u/ctf001) PROGRAM(/bin/sh)" 
ADDRESS TSO "ALU (CTF001) PHRASE('Capture the Flag')" 
ADDRESS TSO "PW NOINTERVAL USER(CTF001)" 
ADDRESS TSO "CO (CTF001) GROUP(FLAGUSER)" 

ADDRESS TSO "SETR RACLIST(FACILITY) REFRESH"
ADDRESS TSO "SETR RACLIST(TCICSTRN) REFRESH"
$$