//RACFJOB  JOB 'RACF',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//STEP001 EXEC PROC=BATREXX
//COPY.SYSUT1 DD *,DLM=$$
/* REXX */
ADDRESS TSO "AG FLAGUSER SUPGROUP(SYS1) OWNER(SYS1)"

ADDRESS TSO "RDEF FACILITY DFHDB2.AUTHTYPE.FL01 UACC(NONE)"
ADDRESS TSO "PE DFHDB2.AUTHTYPE.FL01 CLASS(FACILITY)" || ,
            " ACCESS(READ) ID(YINADMIN,YINUSER,FLAGUSER,STCMAS)"

ADDRESS TSO "RDEF GCICSTRN CTFALL UACC(NONE)"
ADDRESS TSO "RALT GCICSTRN CTFALL ADDMEM(FL01)"
ADDRESS TSO "PE CTFALL CLASS(GCICSTRN) ACCESS(READ)" || ,
            " ID(YINADMIN,YINUSER,FLAGUSER)"

ADDRESS TSO "SETR RACLIST(FACILITY) REFRESH"
ADDRESS TSO "SETR RACLIST(TCICSTRN) REFRESH"
$$