//RUNDDL   JOB 'RUNDDL',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//GRANT   EXEC PGM=IKJEFT1B
//STEPLIB   DD DISP=SHR,DSN=YINDB2.DB2.SDSNEXIT
//          DD DISP=SHR,DSN=DB2V13.DB2.SDSNLOAD
//SYSTSIN   DD *
  DSN SYSTEM(DBY1)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
      LIB('YINDB2.DB2.RUNLIB.LOAD')
  END
//SYSIN     DD DISP=SHR,DSN=YINCIC.CPSM.CIC3WB01.CTF2026.DDL(AA000004)
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*